In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
# Print 1st 5 rows of file
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
### Player count:  List the total amount of players
#------------------------------------------------------------------------------#

player_count = len((purchase_data['SN'].unique()))
#player_count
player_count_df = pd.DataFrame({"Player Count": [player_count]})
player_count_df

   Player Count
0           576

In [4]:
### Purchasing Analysis (Total)
#-----------------------------------------------------------------------#

In [5]:
# Number of Unique Items
item_count = len((purchase_data['Item ID'].unique()))
item_count

183

In [6]:
# Average Purchase Price
ave_price = purchase_data['Price'].mean()
ave_price
#ave_price_rounded = print("{:.2f}".format(ave_price)))
#ave_price_rounded

3.050987179487176

In [7]:
# Total Number of Purchases
purchase_count = len((purchase_data['Purchase ID']))
purchase_count

780

In [8]:
# Total Revenue
total_rev = purchase_data['Price'].sum()
total_rev

2379.77

In [9]:
#  Create Purchasing Analysis Dataframe
purch_analysis_df = pd.DataFrame({"Number of Unique Items": [item_count], "Average Price": [ave_price], "Number of Purchases": [purchase_count], "Total Revenue": [total_rev]})

In [10]:
# Format Price and Revenue columns of chasing Analysis Dataframe
purch_analysis_df["Average Price"] = purch_analysis_df["Average Price"].map("${:.2f}".format)
purch_analysis_df["Total Revenue"] = purch_analysis_df["Total Revenue"].map("${:.2f}".format)
purch_analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

In [11]:
### Gender Demographics
#------------------------------------------------------------------#

In [12]:
#players = (purchase_data['SN'].unique())
#players


# Percentage and Count of Male Players

# Percentage and Count of Female Players
# Percentage and Count of Other / Non-Disclosed

In [13]:
#Players_df = pd.DataFrame({"Players": [players]})
#players_df
#players_df.dtypes

In [14]:
#player_gender_df = pd.DataFrame({"Players": purchase_data['SN'],"Gender":purchase_data['Gender']})
#player_gender_df
#player_gender_df.dtypes

In [15]:
#merge_player_gender = pd.merge(Players_df, player_gender_df, on="Players")
#merge_player_gender

In [16]:
De_Duped_players = purchase_data.drop_duplicates(subset = 'SN', keep = "first")
De_Duped_players.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [17]:
gender_total = len((De_Duped_players['Gender']))
gender_total

576

In [18]:
#Gender column counts
De_Duped_players['Gender'].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [19]:
male_total = De_Duped_players['Gender'].value_counts()['Male']
male_total

484

In [20]:
female_total = De_Duped_players['Gender'].value_counts()['Female']
female_total

81

In [21]:
ND_total = De_Duped_players['Gender'].value_counts()['Other / Non-Disclosed']
ND_total

11

In [22]:
male_percent = male_total/gender_total*100
male_percent

84.02777777777779

In [23]:
female_percent = female_total/gender_total*100
female_percent

14.0625

In [24]:
ND_percent = ND_total/gender_total*100
ND_percent

1.9097222222222223

In [25]:
# Create Gender Dem List of Dicts then create Dataframe
gender_dem_df = pd.DataFrame({"Gender": ['Male', 'Female', 'Other/Non-Disclosed'], 
                "Total Count": [male_total, female_total, ND_total], 
                "Percentage of Players": [male_percent, female_percent, ND_percent]})

gender_dem_df["Percentage of Players"] = gender_dem_df["Percentage of Players"].map("{:.2f}%".format)

gender_dem_df

                Gender  Total Count Percentage of Players
0                 Male          484                84.03%
1               Female           81                14.06%
2  Other/Non-Disclosed           11                 1.91%

In [26]:
### Purchasing Analysis (Gender)
#-----------------------------------------------------------------------------#

# group by gender
gender_grouped_df = purchase_data.groupby(['Gender'])
print(gender_grouped_df)
gender_grouped_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000170569C26D8>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [27]:
# Gender:
#Purchase Count
gen_purch_count = gender_grouped_df["Purchase ID"].count()
gen_purch_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [28]:
#Average Purchase Price
gen_ave_purch_price = gender_grouped_df["Price"].mean()
gen_ave_purch_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [29]:
#Gender Total Purchase Value
gen_total_purch_price = gender_grouped_df["Price"].sum()
gen_total_purch_price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [30]:
#Average Purchase Total per Person by Gender
De_Duped_players_gen_grouped = De_Duped_players.groupby(['Gender'])
print(De_Duped_players_gen_grouped)
De_Duped_players_gen_grouped.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000170569DA3C8>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                          81   81   81       81         81     81
Male                           484  484  484      484        484    484
Other / Non-Disclosed           11   11   11       11         11     11

In [31]:
ave_purch_price_per_person = gen_total_purch_price/De_Duped_players_gen_grouped["Price"].count()
ave_purch_price_per_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
Name: Price, dtype: float64

In [32]:
# Create Gender Purchase Analysis List of Dicts then create Dataframe
gen_purch_anal_df = pd.DataFrame({ "Purchase Count": gen_purch_count, 
                "Average Purchase Price": gen_ave_purch_price, 
                "Total Purchase Value": gen_total_purch_price, 
                "Avg Total Purchase per Person": ave_purch_price_per_person})

gen_purch_anal_df["Average Purchase Price"] = gen_purch_anal_df["Average Purchase Price"].map("${:.2f}".format)
gen_purch_anal_df["Total Purchase Value"] = gen_purch_anal_df["Total Purchase Value"].map("${:.2f}".format)
gen_purch_anal_df["Avg Total Purchase per Person"] = gen_purch_anal_df["Avg Total Purchase per Person"].map("${:.2f}".format)
gen_purch_anal_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [34]:
# bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)

#print(purchase_data["Age"].min())
#print(purchase_data["Age"].max())

bins = [0,10,14,19,24,29,34,39,100]

age_group_labels = ["under 10", "10-14", "15-19", "20-24","25-29", "30-34", "35-39", "40 & over"]

# Slice the data and place it into bins
pd.cut(purchase_data["Age"], bins, labels=age_group_labels).head()

# Place the data series into a new column inside of the DataFrame
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels=age_group_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40 & over
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [35]:
#Group by age group
age_group_group_by_df = purchase_data.groupby(['Age Group'])
print(age_group_group_by_df)
age_group_group_by_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000017056A225C0>

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Group
under 10            32   32   32      32       32         32     32
10-14               19   19   19      19       19         19     19
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40 & over           13   13   13      13       13         13     13

In [36]:
# Age Group Purchase Count
age_group_purch_count = age_group_group_by_df["Purchase ID"].count()
age_group_purch_count

Age Group
under 10      32
10-14         19
15-19        136
20-24        365
25-29        101
30-34         73
35-39         41
40 & over     13
Name: Purchase ID, dtype: int64

In [37]:
# Age Group Average Purchase Price
age_group_ave_price = age_group_group_by_df['Price'].mean()
age_group_ave_price

Age Group
under 10     3.405000
10-14        2.681579
15-19        3.035956
20-24        3.052219
25-29        2.900990
30-34        2.931507
35-39        3.601707
40 & over    2.941538
Name: Price, dtype: float64

In [38]:
# Age Group Total Purchase Value
age_group_total_value = age_group_group_by_df["Price"].sum()
age_group_total_value

Age Group
under 10      108.96
10-14          50.95
15-19         412.89
20-24        1114.06
25-29         293.00
30-34         214.00
35-39         147.67
40 & over      38.24
Name: Price, dtype: float64

In [104]:
## Average Purchase Total per Person by Age Group

De_Duped = purchase_data.drop_duplicates(subset = 'SN', keep = "first")
De_Duped.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40 & over
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [58]:
# Slice the data and place it into bins
bins = [0,10,14,19,24,29,34,39,100]
age_group_labels = ["under 10", "10-14", "15-19", "20-24","25-29", "30-34", "35-39", "40 & over"]

pd.cut(De_Duped['Age'], bins, labels=age_group_labels).head()

0        20-24
1    40 & over
2        20-24
3        20-24
4        20-24
Name: Age, dtype: category
Categories (8, object): [under 10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40 & over]

In [60]:
# Place the data series into a new column inside of the DataFrame
De_Duped['Age Group'] = pd.cut(De_Duped['Age'], bins, labels=age_group_labels)
De_Duped.head()

C:\Users\neell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40 & over
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [61]:
age_group_De_Duped_df = De_Duped.groupby('Age Group')
print(age_group_De_Duped_df)
age_group_De_Duped_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000017056A36EB8>

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Group
under 10            24   24   24      24       24         24     24
10-14               15   15   15      15       15         15     15
15-19              107  107  107     107      107        107    107
20-24              258  258  258     258      258        258    258
25-29               77   77   77      77       77         77     77
30-34               52   52   52      52       52         52     52
35-39               31   31   31      31       31         31     31
40 & over           12   12   12      12       12         12     12

In [62]:
# Average Purchase Total per Person by Age Group
ave_purch_price_per_person_age = age_group_total_value/age_group_De_Duped_df["Price"].count()
ave_purch_price_per_person_age

Age Group
under 10     4.540000
10-14        3.396667
15-19        3.858785
20-24        4.318062
25-29        3.805195
30-34        4.115385
35-39        4.763548
40 & over    3.186667
Name: Price, dtype: float64

In [63]:
# Create Gender Purchase Analysis List of Dicts then create Dataframe
age_purch_anal_df = pd.DataFrame({ "Purchase Count": age_group_purch_count, 
                "Average Purchase Price": age_group_ave_price, 
                "Total Purchase Value": age_group_total_value, 
                "Avg Total Purchase per Person": ave_purch_price_per_person_age})

age_purch_anal_df["Average Purchase Price"] = age_purch_anal_df["Average Purchase Price"].map("${:.2f}".format)
age_purch_anal_df["Total Purchase Value"] = age_purch_anal_df["Total Purchase Value"].map("${:.2f}".format)
age_purch_anal_df["Avg Total Purchase per Person"] = age_purch_anal_df["Avg Total Purchase per Person"].map("${:.2f}".format)
age_purch_anal_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
under 10,32,$3.40,$108.96,$4.54
10-14,19,$2.68,$50.95,$3.40
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40 & over,13,$2.94,$38.24,$3.19

In [ ]:
                    ### Age Demographics
#---------------------------------------------------------#

In [106]:
age_group_player_count = age_group_De_Duped_df["SN"].count()
age_group_player_count

Age Group
under 10      24
10-14         15
15-19        107
20-24        258
25-29         77
30-34         52
35-39         31
40 & over     12
Name: SN, dtype: int64

In [108]:
age_group_player_per = age_group_De_Duped_df["SN"].count()/player_count
age_group_player_per

Age Group
under 10     0.041667
10-14        0.026042
15-19        0.185764
20-24        0.447917
25-29        0.133681
30-34        0.090278
35-39        0.053819
40 & over    0.020833
Name: SN, dtype: float64

In [109]:
age_demo_df = pd.DataFrame({ "Total Count": age_group_player_count, 
                "Percentage of Players": age_group_player_per})

age_demo_df["Percentage of Players"] = age_demo_df["Percentage of Players"].map("{:.2f}%".format)

age_demo_df

           Total Count Percentage of Players
Age Group
under 10            24                 0.04%
10-14               15                 0.03%
15-19              107                 0.19%
20-24              258                 0.45%
25-29               77                 0.13%
30-34               52                 0.09%
35-39               31                 0.05%
40 & over           12                 0.02%

In [ ]:
### Top Spenders
#--------------------------------------------------------------------#

In [66]:

# Identify the the top 5 spenders in the game by total purchase value, then list (in a table):

# SN
top_spenders = purchase_data.groupby('SN')
print(top_spenders)
top_spenders.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001705401E198>

              Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Group
SN
Adairialis76            1    1       1        1          1      1          1
Adastirin33             1    1       1        1          1      1          1
Aeda94                  1    1       1        1          1      1          1
Aela59                  1    1       1        1          1      1          1
Aelaria33               1    1       1        1          1      1          1

In [72]:

# Purchase Count
top_spenders_purch_num = top_spenders['Purchase ID'].count()

# Average Purchase Price
top_spenders_ave_purch_price = top_spenders['Price'].mean()

# Total Purchase Value
top_spenders_tot_purch_val = top_spenders['Price'].sum()

In [76]:
# # Create Top_Spender Purchase Analysis List of Dicts then create Dataframe
top_spender_purch_anal_df = pd.DataFrame({ "Purchase Count": top_spenders_purch_num, 
                "Average Purchase Price": top_spenders_ave_purch_price, 
                "Total Purchase Value": top_spenders_tot_purch_val})

top_spender_purch_anal_df = top_spender_purch_anal_df.sort_values("Total Purchase Value", ascending=False)
top_spender_purch_anal_df["Average Purchase Price"] = top_spender_purch_anal_df["Average Purchase Price"].map("${:.2f}".format)
top_spender_purch_anal_df["Total Purchase Value"] = top_spender_purch_anal_df["Total Purchase Value"].map("${:.2f}".format)
top_spender_purch_anal_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [ ]:
### Most Popular Items
#------------------------------------------------------------------------------#

In [78]:


# Identify the 5 most popular items by purchase count, then list (in a table):

  # Item ID
  # Item Name

top_items = purchase_data.groupby(['Item ID', 'Item Name'])
print(top_items)
top_items.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000017056E77B70>

                            Purchase ID  SN  Age  Gender  Price  Age Group
Item ID Item Name
0       Splinter                      4   4    4       4      4          4
1       Crucifer                      3   3    3       3      3          3
2       Verdict                       6   6    6       6      6          6
3       Phantomlight                  6   6    6       6      6          6
4       Bloodlord's Fetish            5   5    5       5      5          5

In [110]:
# Purchase Count
top_items_purch_num = top_items['Purchase ID'].count()

# Item Price
#top_items_purch_price = top_items['Price'].unique()
top_items_purch_price = top_items['Price'].mean()

# Total Purchase Value
top_items_tot_purch_val = top_items['Price'].sum()

In [112]:
# # Create Top_Spender Purchase Analysis List of Dicts then create Dataframe
top_items_purch_anal_df = pd.DataFrame({"Purchase Count": top_items_purch_num, 
                "Item Price": top_items_purch_price, "Total Purchase Value": top_items_tot_purch_val})

top_items_purch_anal_df = top_items_purch_anal_df.sort_values("Purchase Count", ascending=False)
top_items_purch_anal_df["Item Price"] = top_items_purch_anal_df["Item Price"].map("${:.2f}".format)
top_items_purch_anal_df["Total Purchase Value"] = top_items_purch_anal_df["Total Purchase Value"].map("${:.2f}".format)

top_items_purch_anal_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

In [ ]:
### Most Profitable Items
#-------------------------------------------------------------------#

In [ ]:

# Identify the 5 most profitable items by total purchase value, then list (in a table):
  # Item ID
  # Item Name
  # Purchase Count
  # Item Price
  # Total Purchase Value

In [113]:
# # Create Top_Spender Purchase Analysis List of Dicts then create Dataframe
top_items_purch_anal_df = pd.DataFrame({"Purchase Count": top_items_purch_num, 
                "Item Price": top_items_purch_price, "Total Purchase Value": top_items_tot_purch_val})

top_items_purch_anal_df = top_items_purch_anal_df.sort_values("Total Purchase Value", ascending=False)
top_items_purch_anal_df["Item Price"] = top_items_purch_anal_df["Item Price"].map("${:.2f}".format)
top_items_purch_anal_df["Total Purchase Value"] = top_items_purch_anal_df["Total Purchase Value"].map("${:.2f}".format)

top_items_purch_anal_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80